
[
  {
    "amityville mansion": {
      "greet": "Player: Trick or treat! \nGhost: ooooOOOooooOoO What a brave soul you must be to visit the Amityville Mansion on Halloween night. \nGhost: On second thought, you are not the only brave one visiting the mansion! Someone was here last night causing a ruckus and dropped something. I could’ve sworn it came from his mouth!\n",
      "no item": "Ghost: “Another visitor?! Oh, it’s just you...... *sigh*\n"
    }
  },
  {
    "dracula's mansion": {
      "greet": "Player: Trick or treat! \nDracula: Why hello there human… good timing that you’re here because I am sooo hungry! \nPlayer: Please don’t drink my blood! \nDracula: I would eat you where you stand right now if my tooth didn’t fall out. I can’t find it anywhere. Have you seen it? If you find it for me I will be indebted to you. I pinky promise I won’t eat you! \nFind Item: Wow! You found my fang! Thank you so much. If there is anything I can do to help you please let me know\n",
      "no item": "There's nothing for you here. Sorry!"
    }
  },
    {
      "haunted house": {
        "greet": "Player: Trick or treat! \nZombie: GRAAHHH Welcome to the Haunted Zombie House where we like to scare the locals and eat their yummy brains!\n A black cat: meow….. Meow… \nThe cat rubs your leg and a hair falls out\nPlayer takes Cat hair\n",
        "no item": "Back for more scary fun? No can do, the zombies are on their mandatory union enforced break\n"
      }
    },
    {
      "addam's family house": {
        "greet": "Player: Trick or treat! \nWednesday Addams: *rolls eyes* What do you want? \nPlayer: Candy!!! \nWednesday Addams: We have no candy. The Thing went out to get some this morning and I have not seen him since. So if you want your stupid little candies, I suggest you find him instead! GOODBYE *slams door*\nFind Item: Nice of you to finally come back, Thing. I am tired of these childish trick or treaters. Thank you for finding him\n",
        "no item": "There's nothing for you here. Sorry!"
      }
    },
  {
    "witch's den": {
      "greet": "Player: Trick or treat! \nWitch: Hehehehe Hi young one… I just used the last of my candies to lure Hansel and Gretel into my kitchen. There’s nothing here \nPlayer: How can you be empty handed this time of year!? \nWitch: I’ll tell you what. I can make you a little potion instead. I won’t tell you what it does until after I make it, it’s a surprise. But in order for me to do this, I need you to gather some ingredients for me: Beer, Dentures, and Cat Hair \nFind Item: Thank you for the ingredients dear! This potion has the power to make people __________________________IDK\nPlayer takes potion from witch\n",
      "no item": "There's nothing for you here. Sorry!"
    }
  },
  {
    "mayor's house": {
      "greet": "Player: Trick or treat! \nMayor: Ah hello there youngster! You’re in for a special treat, since you’re our first visitor this evening, and obviously full of ambition -  I'm appointing you deputy mayor for the rest of the day! \nConsole: Do you accept the item? \n",
      "no item": "Player: Trick or treat! \nMayor: You again? Sorry, I don’t have any more treats for you.\n"
    }
  },
  {
    "neighbor's house": {
      "greet": "Player: Trick or treat! \nNeighbor: Omg Hey Bestieee! Here’s some of your favorite candy! Come back anytime :)\nPlayer takes candy\nFind Item: I know I told you to come back anytime, but I’m all out of goods. Sorry bud! \n",
      "no item": "There's nothing for you here. Sorry!"
    }
  },
  {
    "saw house": {
      "greet": "Player: Trick or treat! \nJigsaw: I want to play a game… \n*You feel dizzy and knocks out*\n*You wake up chained to a pole in a cold dark windowless room*\n*You see a saw and the crackle of an old tv*\nJigsaw: There is only one way out… and I have taken your inventory… Good Luck, I wish you the worst\n*You see Thing sneaking around with a key and all of your items*\n*Thing frees you from the chains and you both make a run for it and escape*\nPlayer: Thank you for saving my life, Thing! That’ll be the last time I go to this house! Time for you to get back home\n",
      "no item": "Second Visit: You are scared and alone with no one to help you.\nPlayer: HELP HELP!\nNo one comes, You are not sure how long you have been there \n You become tired and your world starts to fade to black \n"
    }
  },
  {
    "karen's house": {
      "greet": "Karen’s House (without deputy mayor badge)\nPlayer: Trick or treat! \nKaren: How dare you trespass on my property! I’m calling the police.\n**Police arrives**\nOfficer: Ummm what’s the issue Ms. Karen? \nKaren: This intruder (points at you) invaded my property, and made threats against my life - remove them at once!\nOfficer: It’s just a kid.. But if you say so! \nOfficer: Come on, we’re taking you home. Also, your parents are gonna pay a hefty fine for trespassing\nKaren: Oh and one last thing. You stole that from me (points at candy bag).\n**Officer takes your candy bag and hands it to Karen** \nKaren: Muahahahah!!!",
      "no item": "Karen’s House (with deputy mayor badge)\nPlayer: Trick or treat! \nKaren: How dare you trespass on my property! I’m calling the police. \n**Police arrive**\nOfficer: Ummm what’s the issue Ms. Karen? \nKaren: This intruder (points at you) invaded my property, and made threats against my life - remove them at once! \nOfficer: Not so fast - this kid is wearing a deputy mayor’s badge. Deputy mayor is any of this true?\nPlayer: Not. a. word. \nOfficer: That’s the last straw Karen, we’re taking you downtown.\nKaren: Excuse me?! GET YOUR HANDS OFF OF ME! I’m the president of the neighborhood association! I’ll have your badge..\n**Officer tases Karen** \nOfficer: Hosta la vista, Karen\n"
    }
    },
  {
    "grandma's house": {
      "greet": "Player: Trick or treat! \nGrandma: You must be cold honey! I’m sorry but I don’t have warm cookies or candy for you. You can have my dentures!\nPlayer: Sure I’ll take that. Thank you Grandma.\nGrandma: Always a treat to see you \n",
      "no item": "There's nothing for you here. Sorry!"
    }
  },
{
  "freddy & jason's house": {
    "greet": "**You arrive at Freddy and Jason’s house to find them drinking beer on the front porch**\nPlayer: Trick or treat! \n**You realize it’s the two most notorious slasher villains of all time but are too frightened to run**\nFreddy: Sup brochacho! Oh we’re not gonna kill ya, we’re retired!\nPlayer: Umm wait why did you retire?! \nFreddy: We started our careers right out of high school and missed out on the whole college experience. So we decided to enroll in community college and start our own fraternity. Welcome to Kappa Iota Lambda Lambda (ΚΙλλ)\n**Freddy and Jason cheers bottle to each other** \nFreddy: Anyway, someone (points at Jason) destroyed our candy stash, so I guess you can have one a cold one instead. \nConsole: Accept beer?\n",
    "no item": "Freddy: Sorry kid, we’re all out of beer.\n"
  }
},
  {
  "your house": {
  "greet": "Player: Trick or treat! \nMom: You can't trick or treat at your own house!Bye!\n",
    "no item": "There's nothing for you here. Sorry!"
}
  }

]